package main
/********************************************************
 * Асуулт?                                              *
 *      Яагаад энэ програм ямар ч тэмдэгт мөрийг        *
 *      0 урттай гэж тооцоолж байна вэ? 	        *
 *                                                      *
 ********************************************************/
func length(s string) int {
    var index int      /* тэмдэгт мөрийн индекс */

    /* тэмдэгт мөрийн төгсгөл хүртэл давтах */
    for index=0; s[index] != '\0'; index++ {}
        /* хоосон */
    return (index)
}

func main() {
  var line string
  for {
    print("Мөр оруул:")
    fgets(line, sizeof(line), stdin);

    printf("Урт нь (шинэ мөрийг тооцоод): %d\n", length(line));
  }
}
